# MacroModule Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModule Class
Members See Also
---
A container for individual macros. As it relates to the macros editor, one MacroModule represents a project that can be loaded and edited from within the editor.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class MacroModule : IEnumerable<Macro>,
	IDisposable
```

Visual Basic
---
```text
Public Class MacroModule _
	Implements IEnumerable(Of Macro), IDisposable
```

Visual C++
---
```text
public ref class MacroModule : IEnumerable<Macro^>,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Macros..::..MacroModule
# See Also
MacroModule Members
Autodesk.Revit.DB.Macros Namespace